content/topics/emacs.md
+++
title = "Emacs"
draft = false
+++

## Resources {#resources}


### Keyboard shortcuts {#keyboard-shortcuts}

-   2022-09-05 ◦ [GitHub - VernonGrant/emacs-keyboard-shortcuts: A list of Emacs keyboard shortcuts that I use on a regular basis.](https://github.com/VernonGrant/emacs-keyboard-shortcuts)


### Bookmarks {#bookmarks}

-   2022-10-11 ◦ [EmacsWiki: Book Marks](https://www.emacswiki.org/emacs/BookMarks)

    > Some keys in **Bookmark List**:
    >
    > ‘a’ – show annotation for the current bookmark
    > ‘A’ – show all annotations for your bookmarks
    > ‘d’ – mark various entries for deletion (‘x’ – to delete them)
    > ‘e’ – edit the annotation for the current bookmark
    > ‘m’ – mark various entries for display and other operations, (‘v’ – to visit)
    > ‘o’ – visit the current bookmark in another window, keeping the bookmark list open
    > ‘C-o’ – switch to the current bookmark in another window
    > ‘r’ – rename the current bookmark


### Evil {#evil}

-   2022-09-01 ◦ [GitHub - edkolev/evil-goggles: Display visual hint on evil edit operations](https://github.com/edkolev/evil-goggles)


### Collection of awesome packages {#collection-of-awesome-packages}

-   2022-09-01 ◦ [GitHub - emacs-tw/awesome-emacs: A community driven list of useful Emacs packages, libraries and other items.](https://github.com/emacs-tw/awesome-emacs)
-   2022-09-01 ◦ [Emacs by Ernst de Hart (ehartc) | ZEEF](https://emacs.zeef.com/ehartc)
-   2022-09-01 ◦ [Lets share your top 3 packages that you cant live without. : emacs](https://www.reddit.com/r/emacs/comments/wcupae/lets_share_your_top_3_packages_that_you_cant_live/)
-   2022-09-01 ◦ [What are some must-have packages for emacs? : emacs](https://www.reddit.com/r/emacs/comments/w4gxoa/what_are_some_musthave_packages_for_emacs/)


### Writing {#writing}

-   2022-09-20 ◦ [Creative writing with Emacs – Jacmoe's Cyber Soapbox](https://jacmoes.wordpress.com/2019/09/24/creative-writing-with-emacs/)